export interface ShellInfo {
  name: string;
  tth: string[];
  description: string;
}

export const TTH: ShellInfo[] = [
  {
    name: 'ТМ-62',
    tth: [
      'Маса: 9,5 - 10кг',
      'Висота: 128 мм',
      'Діаметр: 320 мм',
      'Вибухова Речовина: Тротилч, ТГА',
      'Маса вибухової речовини: 7.0—7.5 кг',
    ],
    description:
      'Клас радянських противотанкових мін, розроблений як наступник ТМ-57. Міна ТМ-62М є головною базовою моделлю сімейства ТМ-62, які розрізняються між собою матеріалом і формою корпусу, та вибухово-ваговими характеристиками. До цього класу крім ТМ-62М, входять ТМ-62П, ТМ-62П2, ТМ-62П3, ТМ-62Т, ТМ-62Д та ТМ-62Б. Міни серії ТМ-62 застосовуються з детонаторами МВЧ-62, МВЗ-62, МВП-62М, МВШ-62, МВ-62, МВД-62, МВН-72 і МВН-80. Залежно від наявності детонаторів і застосовуваних засобів механізації мінування, всі міни серії ТМ-62 можуть споряджатися будь-яким з перерахованих детонаторів.',
  },
  {
    name: 'ОЗМ-72',
    tth: [
      'Маса: 5 кг',
      'Висота: 172 мм',
      'Діаметр: 106 мм',
      'Вибухова Речовина: ТНТ',
      'Маса вибухової речовини: 660 г',
      'Радіус суцільного ураження: 25 м',
      'Кількість готових осколків: 2400 шт.',
    ],
    description:
      'Клас радянських противотанкових мін, розроблений як наступник ТМ-57. Міна ТМ-62М є головною базовою моделлю сімейства ТМ-62, які розрізняються між собою матеріалом і формою корпусу, та вибухово-ваговими характеристиками. До цього класу крім ТМ-62М, входять ТМ-62П, ТМ-62П2, ТМ-62П3, ТМ-62Т, ТМ-62Д та ТМ-62Б. Міни серії ТМ-62 застосовуються з детонаторами МВЧ-62, МВЗ-62, МВП-62М, МВШ-62, МВ-62, МВД-62, МВН-72 і МВН-80. Залежно від наявності детонаторів і застосовуваних засобів механізації мінування, всі міни серії ТМ-62 можуть споряджатися будь-яким з перерахованих детонаторів.',
  },
  {
    name: 'ПМН-2',
    tth: [
      'Корпус: пластмаса',
      'Маса: 400 г',
      'Маса заряду вибухової речовини: 100 г',
      'Діаметр: 120 мм',
      'Висота: 54 мм',
      'Тип індикатора цілі: натискний',
      'Сила спрацювання: 8–25 кг',
    ],
    description:
      'Протипіхотна фугасна натискної дії. Призначена для виведення з ладу особового складу супротивника. Ураження людини відбувається шляхом руйнування нижньої частини ноги (ступні) при вибуху заряду міни в момент наступання ногою на індикатор цілі (чорний хрестоподібний виступ на верхній площині) міни. Зазвичай під час вибуху міни відривається повністю ступня ноги, якою солдат наступив на міну, й, залежно від відстані другої ноги від місця вибуху, вона також може бути сильно пошкоджена або не зазнати пошкоджень зовсім. Крім того, ударна хвиля досить великого заряду ВР позбавляє людину свідомості, висока температура вибухових газів може завдати сильних опіків нижніх кінцівок. Смерть може наступити від больового шоку чи втрати крові при несвоєчасному наданні першої допомоги. Міна може встановлюватися як на ґрунт, так і в ґрунт, у сніг, вручну чи розкладатися засобами механізації (причіпні мінні розкладники ПМР-1, ПМР-2, причіпні мінні загороджувачі ПМЗ-4), але у всіх випадках переклад міни в бойове положення здійснюється вручну. Герметичність міни дозволяє використовувати її у водонасичених і болотистих ґрунтах. Установка мін під воду (прибережна смуга водних перешкод, броди) не допускається з огляду на її плавучість. Термін бойової роботи міни не обмежується. Самоліквідатором міни не оснащуються. Незйомних та незнешкоджуваних елементів не має, але особливості конструкції унеможливлюють зворотний переклад міни з бойового в безпечне положення. Тому міна відноситься до категорії незнешкоджуваних. Міна має детонатор і запал, які є частиною конструкції міни.',
  },
  {
    name: 'МС-3',
    tth: [
      'Маса: 660 г',
      'Висота: 65 мм',
      'Діаметр: 110 мм',
      'Вибухова Речовина: Тротил',
      'Маса вибухової речовини: 340 г',
      'Зусилля утримування від спрацьовування: 5 кг',
    ],
    description:
      'Міна призначена для використання як пристрій невиймальності для протитанкових та інших мін, що не мають власного такого пристрою. Наприклад, протитанкових мін серії ТМ-62. Крім того, міна може використовуватися як міна-пастка розвантажувальної дії.',
  },
  {
    name: '122 БК-463М',
    tth: ['Калібр: 122мм'],
    description: '',
  },
  {
    name: '122 ОФ-462',
    tth: ['Калібр: 122мм'],
    description: '',
  },
  {
    name: '122 С-4',
    tth: ['Калібр: 122мм'],
    description: '',
  },
  {
    name: '152 Ш-2',
    tth: ['Калібр: 152мм'],
    description: '',
  },
];
